[Killed] StringLiteral
main/components/Courses/StudentCoursesTable.jsx:8:6
 
 export function StudentCoursesTable({ testid }) {
   const { data: courses } = useBackend(
-    ["/api/courses/list"],
+    [""],
     // Stryker disable next-line StringLiteral : The default value for an empty ("") method is GET. Therefore, there is no way to kill a mutation that transforms "GET" to ""
     { method: "GET", url: "/api/courses/list" },
killedBy: StudentCoursesTable tests join callback works
statusReason: Cannot read properties of undefined (reading 'dataUpdateCount')

[Killed] ObjectLiteral
main/components/Courses/StudentCoursesTable.jsx:10:5
   const { data: courses } = useBackend(
     ["/api/courses/list"],
     // Stryker disable next-line StringLiteral : The default value for an empty ("") method is GET. Therefore, there is no way to kill a mutation that transforms "GET" to ""
-    { method: "GET", url: "/api/courses/list" },
+    {},
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: HomePageLoggedIn tests tables render correctly
statusReason: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/components/Courses/StudentCoursesTable.jsx:15:38
     [],
   );
 
-  const onJoinSuccess = (message) => {
-    toast(message);
-  };
+  const onJoinSuccess = (message) => {};
 
   const onJoinFail = (result) => {
killedBy: StudentCoursesTable tests join callback works
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/components/Courses/StudentCoursesTable.jsx:19:34
     toast(message);
   };
 
-  const onJoinFail = (result) => {
-    toast(result.response.data ? result.response.data : result.message);
-  };
+  const onJoinFail = (result) => {};
 
   const cellToAxiosParamsStudent = (cell) => {
killedBy: StudentCoursesTable tests right message on 400
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/components/Courses/StudentCoursesTable.jsx:23:46
     toast(result.response.data ? result.response.data : result.message);
   };
 
-  const cellToAxiosParamsStudent = (cell) => {
-    return {
-      url: `/api/rosterstudents/joinCourse`,
-      method: "PUT",
-      params: {
-        rosterStudentId: cell.row.original.rosterStudentId,
-      },
-    };
-  };
+  const cellToAxiosParamsStudent = (cell) => {};
 
   const studentJoinMutation = useBackendMutation(
killedBy: StudentCoursesTable tests join callback works
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] ObjectLiteral
main/components/Courses/StudentCoursesTable.jsx:24:12
   };
 
   const cellToAxiosParamsStudent = (cell) => {
-    return {
-      url: `/api/rosterstudents/joinCourse`,
-      method: "PUT",
-      params: {
-        rosterStudentId: cell.row.original.rosterStudentId,
-      },
-    };
+    return {};
   };
 
killedBy: StudentCoursesTable tests join callback works
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] StringLiteral
main/components/Courses/StudentCoursesTable.jsx:25:12
 
   const cellToAxiosParamsStudent = (cell) => {
     return {
-      url: `/api/rosterstudents/joinCourse`,
+      url: ``,
       method: "PUT",
       params: {
killedBy: StudentCoursesTable tests join callback works
statusReason: expected '' to be '/api/rosterstudents/joinCourse' // Object.is equality

[Killed] ObjectLiteral
main/components/Courses/StudentCoursesTable.jsx:27:15
     return {
       url: `/api/rosterstudents/joinCourse`,
       method: "PUT",
-      params: {
-        rosterStudentId: cell.row.original.rosterStudentId,
-      },
+      params: {},
     };
   };
killedBy: StudentCoursesTable tests join callback works
statusReason: expected {} to deeply equal { rosterStudentId: 22 }

[Killed] BlockStatement
main/components/Courses/StudentCoursesTable.jsx:39:53
     [`/api/courses/list`],
   );
 
-  const joinStudentCourseCallback = async (cell) => {
-    studentJoinMutation.mutate(cell);
-  };
+  const joinStudentCourseCallback = async (cell) => {};
 
   const isStudentJoining = (cell) => {
killedBy: StudentCoursesTable tests join callback works
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] BlockStatement
main/components/Courses/StudentCoursesTable.jsx:43:38
     studentJoinMutation.mutate(cell);
   };
 
-  const isStudentJoining = (cell) => {
-    return (
-      studentJoinMutation.isPending &&
-      studentJoinMutation.variables.row.index === cell.row.index
-    );
-  };
+  const isStudentJoining = (cell) => {};
 
   return (
killedBy: StudentCoursesTable tests Loading message renders
statusReason: Unable to find an element with the text: Joining.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CoursesTable"

[Killed] ConditionalExpression
main/components/Courses/StudentCoursesTable.jsx:45:7
 
   const isStudentJoining = (cell) => {
     return (
-      studentJoinMutation.isPending &&
-      studentJoinMutation.variables.row.index === cell.row.index
+      false
     );
   };
killedBy: StudentCoursesTable tests Loading message renders
statusReason: Unable to find an element with the text: Joining.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CoursesTable"

[Killed] LogicalOperator
main/components/Courses/StudentCoursesTable.jsx:45:7
 
   const isStudentJoining = (cell) => {
     return (
-      studentJoinMutation.isPending &&
-      studentJoinMutation.variables.row.index === cell.row.index
+      studentJoinMutation.isPending || studentJoinMutation.variables.row.index === cell.row.index
     );
   };
killedBy: HomePageLoggedIn tests right message on 400
statusReason: Unable to find an element with the text: Join Course. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
main/components/Courses/StudentCoursesTable.jsx:46:7
   const isStudentJoining = (cell) => {
     return (
       studentJoinMutation.isPending &&
-      studentJoinMutation.variables.row.index === cell.row.index
+      true
     );
   };
killedBy: StudentCoursesTable tests Loading message renders
statusReason: Found multiple elements with the text: Joining...

Here are the matching elements:

Ignored nodes: comments, script, style
<button
  class="btn btn-primary"
  data-testid="CoursesTable-cell-row-1-col-studentStatus-button"

[Killed] EqualityOperator
main/components/Courses/StudentCoursesTable.jsx:46:7
   const isStudentJoining = (cell) => {
     return (
       studentJoinMutation.isPending &&
-      studentJoinMutation.variables.row.index === cell.row.index
+      studentJoinMutation.variables.row.index !== cell.row.index
     );
   };
killedBy: StudentCoursesTable tests Loading message renders
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Join Course
Received:
  Joining...
