[Killed] StringLiteral
main/components/Courses/CourseWarningBanner.jsx:20:6
   );
 
   const { data: defaultBasePermission } = useBackend(
-    [`/api/github/graphql/defaultbasepermission?courseId=${courseId}`],
+    [``],
     {
       method: "GET",
killedBy: CourseWarningBanner tests renders warning banner on warning return
statusReason: expected "useBackend" to be called with arguments: [ …(5) ]

Received:

  1st useBackend call:

  [
    [

[Killed] ObjectLiteral
main/components/Courses/CourseWarningBanner.jsx:21:5
 
   const { data: defaultBasePermission } = useBackend(
     [`/api/github/graphql/defaultbasepermission?courseId=${courseId}`],
-    {
-      method: "GET",
-      url: `/api/github/graphql/defaultbasepermission?courseId=${courseId}`,
-    },
+    {},
     undefined,
     true,
killedBy: CourseWarningBanner tests renders warning banner on warning return
statusReason: expected "useBackend" to be called with arguments: [ …(5) ]

Received:

  1st useBackend call:

  [
    [

[Killed] StringLiteral
main/components/Courses/CourseWarningBanner.jsx:29:18
     true,
     {
       placeholderData: "None",
-      staleTime: "static",
+      staleTime: "",
     },
   );
killedBy: CourseWarningBanner tests renders warning banner on warning return
statusReason: expected "useBackend" to be called with arguments: [ …(5) ]

Received:

  1st useBackend call:

  [
    [

[Killed] ConditionalExpression
main/components/Courses/CourseWarningBanner.jsx:34:5
   );
 
   const showDefaultBasePermissionWarning =
-    defaultBasePermission && defaultBasePermission !== "None";
+    true;
 
   return (
killedBy: CourseWarningBanner tests Does not render banner on false
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="fade alert alert-warning show"
  role="alert"
>
  Warning: the organization setting for Default Base Permission is not the recommended value of None. This means that students in the organization may be able to access other students' private repos.

[Killed] LogicalOperator
main/components/Courses/CourseWarningBanner.jsx:34:5
   );
 
   const showDefaultBasePermissionWarning =
-    defaultBasePermission && defaultBasePermission !== "None";
+    defaultBasePermission || defaultBasePermission !== "None";
 
   return (
killedBy: CourseWarningBanner tests Does not render banner on false
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="fade alert alert-warning show"
  role="alert"
>
  Warning: the organization setting for Default Base Permission is not the recommended value of None. This means that students in the organization may be able to access other students' private repos.

[Killed] ConditionalExpression
main/components/Courses/CourseWarningBanner.jsx:45:8
         </Alert>
       )}
 
-      {showDefaultBasePermissionWarning && (
-        <Alert variant="warning">
-          Warning: the organization setting for Default Base Permission is not
-          the recommended value of None. This means that students in the
-          organization may be able to access other students&apos; private repos.{" "}
-          <a
-            href={`https://github.com/organizations/${orgName}/settings/member_privileges`}
-            target="_blank"
-            rel="noreferrer"
-          >
-            You can change that setting here.
-          </a>
-        </Alert>
-      )}
+      {false}
     </>
   );
killedBy: CourseWarningBanner tests renders default base permissions warning when default base permission is not None
statusReason: Unable to find role="alert"

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
main/components/Courses/CourseWarningBanner.jsx:45:8
         </Alert>
       )}
 
-      {showDefaultBasePermissionWarning && (
-        <Alert variant="warning">
-          Warning: the organization setting for Default Base Permission is not
-          the recommended value of None. This means that students in the
-          organization may be able to access other students&apos; private repos.{" "}
-          <a
-            href={`https://github.com/organizations/${orgName}/settings/member_privileges`}
-            target="_blank"
-            rel="noreferrer"
-          >
-            You can change that setting here.
-          </a>
-        </Alert>
-      )}
+      {true}
     </>
   );
killedBy: CourseWarningBanner tests renders default base permissions warning when default base permission is not None
statusReason: Unable to find role="alert"

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/components/Courses/CourseWarningBanner.jsx:49:82
         <Alert variant="warning">
           Warning: the organization setting for Default Base Permission is not
           the recommended value of None. This means that students in the
-          organization may be able to access other students&apos; private repos.{" "}
+          organization may be able to access other students&apos; private repos.{""}
           <a
             href={`https://github.com/organizations/${orgName}/settings/member_privileges`}
killedBy: CourseWarningBanner tests renders default base permissions warning when default base permission is not None
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Warning: the organization setting for Default Base Permission is not the recommended value of None. This means that students in the organization may be able to access other students' private repos. You can change that setting here.
Received:
  Warning: the organization setting for Default Base Permission is not the recom
