[Killed] StringLiteral
main/components/Courses/CoursesTable.jsx:18:15
       accessorKey: "id", // accessor is the "key" in the data
     },
     {
-      header: "Course Name",
+      header: "",
       accessorKey: "courseName",
       cell: ({ cell }) => {
killedBy: CoursesTable tests Has the expected column headers and content
statusReason: Unable to find an element with the text: Course Name. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CoursesTable"

[Killed] BlockStatement
main/components/Courses/CoursesTable.jsx:20:27
     {
       header: "Course Name",
       accessorKey: "courseName",
-      cell: ({ cell }) => {
-        return (
-          <OverlayTrigger
-            placement="right"
-            overlay={
-              <Tooltip id={`tooltip-coursename-${cell.row.index}`}>
-                View course details
-              </Tooltip>
-            }
-          >
-            <Link
-              to={`${courseShowRoutePrefix}/${cell.row.original.id}`}
-              data-testid={`CoursesTable-cell-row-${cell.row.index}-col-${cell.column.id}-link`}
-            >
-              {cell.row.original.courseName}
-            </Link>
-          </OverlayTrigger>
-        );
-      },
+      cell: ({ cell }) => {},
     },
     {
killedBy: HomePageLoggedIn tests tables render correctly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  CMPSC 156
Received:

[Killed] StringLiteral
main/components/Courses/CoursesTable.jsx:45:15
       accessorKey: "term",
     },
     {
-      header: "School",
+      header: "",
       id: "school",
       accessorKey: "school.displayName",
killedBy: CoursesTable tests Has the expected column headers and content
statusReason: Unable to find an element with the text: School. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CoursesTable"

[Killed] BlockStatement
main/components/Courses/CoursesTable.jsx:51:40
     },
   ];
 
-  const viewInviteCallback = (cell) => {
-    const organizationName = cell.row.original.orgName;
-    const gitInvite = `https://github.com/orgs/${organizationName}/invitation`;
-    window.open(gitInvite, "_blank");
-  };
+  const viewInviteCallback = (cell) => {};
 
   const renderTooltip = (studentStatus) =>
killedBy: CoursesTable tests Does not call joinCallback when storybook is explicitly false for button 'View Invite'
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.jsx:62:9
       let set_message;
 
       switch (studentStatus) {
-        case "PENDING":
-          set_message =
-            "This course has not been completely set up by your instructor yet.";
-          break;
+        case "PENDING":
         case "JOINCOURSE":
           set_message =
killedBy: CoursesTable tests tooltips for PENDING status
statusReason: Unable to find an element with the text: This course has not been completely set up by your instructor yet.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.jsx:66:9
           set_message =
             "This course has not been completely set up by your instructor yet.";
           break;
-        case "JOINCOURSE":
-          set_message =
-            "Clicking this button will generate an invitation to the GitHub organization associated with this course.";
-          break;
+        case "JOINCOURSE":
         case "INVITED":
           set_message =
killedBy: CoursesTable tests tooltips for JOINCOURSE status
statusReason: 
Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CoursesTable"

[Killed] StringLiteral
main/components/Courses/CoursesTable.jsx:66:14
           set_message =
             "This course has not been completely set up by your instructor yet.";
           break;
-        case "JOINCOURSE":
+        case "":
           set_message =
             "Clicking this button will generate an invitation to the GitHub organization associated with this course.";
killedBy: CoursesTable tests tooltips for JOINCOURSE status
statusReason: 
Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CoursesTable"

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.jsx:74:9
           set_message =
           break;
-        case "OWNER":
-          set_message =
-            "You are an owner of the GitHub organization associated with this course.";
-          break;
+        case "OWNER":
         case "MEMBER":
           set_message =
killedBy: CoursesTable tests tooltips for OWNER status
statusReason: Unable to find an element with the text: You are an owner of the GitHub organization associated with this course.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"

[Killed] StringLiteral
main/components/Courses/CoursesTable.jsx:74:14
           set_message =
           break;
-        case "OWNER":
+        case "":
           set_message =
             "You are an owner of the GitHub organization associated with this course.";
killedBy: CoursesTable tests tooltips for OWNER status
statusReason: Unable to find an element with the text: You are an owner of the GitHub organization associated with this course.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"

[Killed] StringLiteral
main/components/Courses/CoursesTable.jsx:76:13
           break;
         case "OWNER":
           set_message =
-            "You are an owner of the GitHub organization associated with this course.";
+            "";
           break;
         case "MEMBER":
killedBy: CoursesTable tests tooltips for OWNER status
statusReason: Unable to find an element with the text: You are an owner of the GitHub organization associated with this course.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.jsx:78:9
           set_message =
             "You are an owner of the GitHub organization associated with this course.";
           break;
-        case "MEMBER":
-          set_message =
-            "You are a member of the GitHub organization associated with this course.";
-          break;
+        case "MEMBER":
         default:
           set_message = "Tooltip for illegal status that will never occur";
killedBy: CoursesTable tests tooltips for MEMBER status
statusReason: Unable to find an element with the text: You are a member of the GitHub organization associated with this course.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"

[Killed] StringLiteral
main/components/Courses/CoursesTable.jsx:78:14
           set_message =
             "You are an owner of the GitHub organization associated with this course.";
           break;
-        case "MEMBER":
+        case "":
           set_message =
             "You are a member of the GitHub organization associated with this course.";
killedBy: CoursesTable tests tooltips for MEMBER status
statusReason: Unable to find an element with the text: You are a member of the GitHub organization associated with this course.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"

[Killed] StringLiteral
main/components/Courses/CoursesTable.jsx:80:13
           break;
         case "MEMBER":
           set_message =
-            "You are a member of the GitHub organization associated with this course.";
+            "";
           break;
         default:
killedBy: CoursesTable tests tooltips for MEMBER status
statusReason: Unable to find an element with the text: You are a member of the GitHub organization associated with this course.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.jsx:82:9
           set_message =
             "You are a member of the GitHub organization associated with this course.";
           break;
-        default:
-          set_message = "Tooltip for illegal status that will never occur";
-          break;
+        default:
       }
       return (
killedBy: CoursesTable tests tooltips for an illegal status
statusReason: Unable to find an element with the text: Tooltip for illegal status that will never occur. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CoursesTab

[Killed] MethodExpression
main/components/Courses/CoursesTable.jsx:87:25
           break;
       }
       return (
-        <Tooltip id={`${studentStatus.toLowerCase()}-tooltip`} {...props}>
+        <Tooltip id={`${studentStatus.toUpperCase()}-tooltip`} {...props}>
           {set_message}
         </Tooltip>
killedBy: CoursesTable tests expect the correct tooltip ID
statusReason: expect(element).toHaveAttribute("id", "member-tooltip") // element.getAttribute("id") === "member-tooltip"

Expected the element to have attribute:
  id="member-tooltip"
Received:
  id="MEMBER-tooltip"

[Killed] StringLiteral
main/components/Courses/CoursesTable.jsx:96:15
   const columnsWithStatus = [
     ...columns,
     {
-      header: "Status",
+      header: "",
       accessorKey: "studentStatus",
       cell: ({ cell }) => {
killedBy: CoursesTable tests Has the expected column headers and content
statusReason: Unable to find an element with the text: Status. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CoursesTable"

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.jsx:100:13
       accessorKey: "studentStatus",
       cell: ({ cell }) => {
         const status = cell.row.original.studentStatus;
-        if (status === "PENDING") {
+        if (false) {
           return (
             <OverlayTrigger
killedBy: CoursesTable tests Has the expected column headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Pending
Received:
  PENDING

[Killed] BlockStatement
main/components/Courses/CoursesTable.jsx:100:35
       accessorKey: "studentStatus",
       cell: ({ cell }) => {
         const status = cell.row.original.studentStatus;
-        if (status === "PENDING") {
-          return (
-            <OverlayTrigger
-              placement="right"
-              overlay={renderTooltip("PENDING")}
-            >
-              <span className="text-warning">Pending</span>
-            </OverlayTrigger>
-          );
-        } else if (status === "JOINCOURSE") {
+        if (status === "PENDING") {} else if (status === "JOINCOURSE") {
           const cellIsLoading = isLoading(cell);
           return (
killedBy: HomePageLoggedIn tests tables render correctly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Pending
Received:
  PENDING

[Killed] StringLiteral
main/components/Courses/CoursesTable.jsx:104:38
           return (
             <OverlayTrigger
               placement="right"
-              overlay={renderTooltip("PENDING")}
+              overlay={renderTooltip("")}
             >
               <span className="text-warning">Pending</span>
killedBy: CoursesTable tests tooltips for PENDING status
statusReason: Unable to find an element with the text: This course has not been completely set up by your instructor yet.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-

[Killed] EqualityOperator
main/components/Courses/CoursesTable.jsx:109:20
               <span className="text-warning">Pending</span>
             </OverlayTrigger>
           );
-        } else if (status === "JOINCOURSE") {
+        } else if (status !== "JOINCOURSE") {
           const cellIsLoading = isLoading(cell);
           return (
killedBy: HomePageLoggedIn tests right message on 400
statusReason: Unable to find an element by: [data-testid="StaffCoursesTable-cell-row-1-col-studentStatus-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.jsx:109:20
               <span className="text-warning">Pending</span>
             </OverlayTrigger>
           );
-        } else if (status === "JOINCOURSE") {
+        } else if (false) {
           const cellIsLoading = isLoading(cell);
           return (
killedBy: HomePageLoggedIn tests right message on 400
statusReason: Unable to find an element with the text: Join Course. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/components/Courses/CoursesTable.jsx:119:28
               <span>
                 <Button
                   variant={"primary"}
-                  onClick={() => joinCallback(cell)}
+                  onClick={() => undefined}
                   data-testid={`${testId}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
                   disabled={cellIsLoading}
killedBy: StudentCoursesTable tests join callback works
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] EqualityOperator
main/components/Courses/CoursesTable.jsx:140:20
               </span>
             </OverlayTrigger>
           );
-        } else if (status === "INVITED") {
+        } else if (status !== "INVITED") {
           return (
             <OverlayTrigger
killedBy: CoursesTable tests Has the expected column headers and content
statusReason: Unable to find an element with the text: Member. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CoursesTable"

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.jsx:140:20
               </span>
             </OverlayTrigger>
           );
-        } else if (status === "INVITED") {
+        } else if (true) {
           return (
             <OverlayTrigger
killedBy: CoursesTable tests Has the expected column headers and content
statusReason: Unable to find an element with the text: Member. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CoursesTable"

[Killed] StringLiteral
main/components/Courses/CoursesTable.jsx:144:38
           return (
             <OverlayTrigger
               placement="right"
-              overlay={renderTooltip("INVITED")}
+              overlay={renderTooltip("")}
             >
               <span>
killedBy: CoursesTable tests tooltips for INVITED status
statusReason: 
Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CoursesTable"

[Killed] ArrowFunction
main/components/Courses/CoursesTable.jsx:149:28
               <span>
                 <Button
                   variant={"primary"}
-                  onClick={() => viewInviteCallback(cell)}
+                  onClick={() => undefined}
                   data-testid={`${testId}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
                 >
killedBy: CoursesTable tests Does not call joinCallback when storybook is explicitly false for button 'View Invite'
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.jsx:157:20
               </span>
             </OverlayTrigger>
           );
-        } else if (status === "OWNER") {
+        } else if (false) {
           return (
             <OverlayTrigger placement="right" overlay={renderTooltip("OWNER")}>
killedBy: CoursesTable tests Has the expected column headers and content
statusReason: Unable to find an element with the text: Owner. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CoursesTable"

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.jsx:157:20
               </span>
             </OverlayTrigger>
           );
-        } else if (status === "OWNER") {
+        } else if (true) {
           return (
             <OverlayTrigger placement="right" overlay={renderTooltip("OWNER")}>
killedBy: CoursesTable tests Has the expected column headers and content
statusReason: Unable to find an element with the text: Member. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CoursesTable"

[Killed] BlockStatement
main/components/Courses/CoursesTable.jsx:163:41
               <span className="text-info">Owner</span>
             </OverlayTrigger>
           );
-        } else if (status === "MEMBER") {
-          return (
-            <OverlayTrigger placement="right" overlay={renderTooltip("MEMBER")}>
-              <span className="text-primary">Member</span>
-            </OverlayTrigger>
-          );
-        }
+        } else if (status === "MEMBER") {}
         return (
           <OverlayTrigger
killedBy: CoursesTable tests Has the expected column headers and content
statusReason: Unable to find an element with the text: Member. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CoursesTable"

[Killed] EqualityOperator
main/components/Courses/CoursesTable.jsx:163:20
               <span className="text-info">Owner</span>
             </OverlayTrigger>
           );
-        } else if (status === "MEMBER") {
+        } else if (status !== "MEMBER") {
           return (
             <OverlayTrigger placement="right" overlay={renderTooltip("MEMBER")}>
killedBy: CoursesTable tests Has the expected column headers and content
statusReason: Unable to find an element with the text: Illegal status that will never occur. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CoursesTable"

[Killed] StringLiteral
main/components/Courses/CoursesTable.jsx:165:70
           );
         } else if (status === "MEMBER") {
           return (
-            <OverlayTrigger placement="right" overlay={renderTooltip("MEMBER")}>
+            <OverlayTrigger placement="right" overlay={renderTooltip("")}>
               <span className="text-primary">Member</span>
             </OverlayTrigger>
killedBy: CoursesTable tests tooltips for MEMBER status
statusReason: Unable to find an element with the text: You are a member of the GitHub organization associated with this course.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
