[Killed] BlockStatement
main/pages/Student/StudentCourseShowPage.jsx:6:49
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 import { Tab, Tabs } from "react-bootstrap";
 
-export default function StudentCourseShowPage() {
-  const { id } = useParams();
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <div className="border rounded-3 p-4 mb-4">
-          <h1 className="h3 mb-0">Student Course: {id}</h1>
-        </div>
-        <Tabs defaultActiveKey="placeholder">
-          <Tab eventKey="placeholder" title="Placeholder" className="pt-2">
-            <div className="mt-3">
-              <p>More features coming soon.</p>
-            </div>
-          </Tab>
-        </Tabs>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function StudentCourseShowPage() {}
 
killedBy: StudentCourseShowPage tests renders correctly with student user
statusReason: Unable to find an element with the text: Student Course: 123. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
