[Killed] BooleanLiteral
main/components/TabComponent/StaffTabComponent.jsx:26:45
   currentUser,
 }) {
   const [postModal, showPostModal] = useState(false);
-  const [csvModal, showCsvModal] = useState(false);
+  const [csvModal, showCsvModal] = useState(true);
   const { data: courseStaff } = useBackend(
     [`/api/coursestaff/course?courseId=${courseId}`],
killedBy: StaffTabComponent Tests Table Renders with no students
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="InstructorCourseShowPage-csv-modal"
>
  <div
    class="modal-content"

[Killed] ObjectLiteral
main/components/TabComponent/StaffTabComponent.jsx:67:12
   const objectToAxiosParamsCSV = (formData) => {
     const file = new FormData();
     file.append("file", formData.upload[0]);
-    return {
-      url: `/api/coursestaff/upload/csv`,
-      data: file,
-      params: {
-        courseId: courseId,
-      },
-      method: "POST",
-    };
+    return {};
   };
 
killedBy: StaffTabComponent Tests CSV upload button opens modal and submits file, invalidates cache
statusReason: Cannot read properties of undefined (reading 'params')

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ArrowFunction
main/components/TabComponent/StaffTabComponent.jsx:80:18
   const staffCsvMutation = useBackendMutation(
     objectToAxiosParamsCSV,
     {
-      onSuccess: () => onSuccessStaff(showCsvModal),
+      onSuccess: () => undefined,
       onError: (error) => {
         toast.error(
killedBy: StaffTabComponent Tests CSV upload button opens modal and submits file, invalidates cache
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
main/components/TabComponent/StaffTabComponent.jsx:81:27
     objectToAxiosParamsCSV,
     {
       onSuccess: () => onSuccessStaff(showCsvModal),
-      onError: (error) => {
-        toast.error(
-          `Error uploading CSV: ${JSON.stringify(error.response.data, null, 2)}`,
-        );
-      },
+      onError: (error) => {},
     },
     [`/api/coursestaff/course?courseId=${courseId}`],
killedBy: StaffTabComponent Tests CSV upload shows error toast on failure
statusReason: expected "vi.fn()" to be called with arguments: [ StringContaining{…} ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ArrowFunction
main/components/TabComponent/StaffTabComponent.jsx:109:17
     <div data-testid={`${testIdPrefix}-StaffTabComponent`}>
       <Modal
         show={csvModal}
-        onHide={() => showCsvModal(false)}
+        onHide={() => undefined}
         centered={true}
         data-testid={`${testIdPrefix}-csv-modal`}
killedBy: StaffTabComponent Tests CSV modal closes on close button
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="InstructorCourseShowPage-csv-modal"
>
  <div
    class="modal-content"

[Killed] BooleanLiteral
main/components/TabComponent/StaffTabComponent.jsx:109:36
     <div data-testid={`${testIdPrefix}-StaffTabComponent`}>
       <Modal
         show={csvModal}
-        onHide={() => showCsvModal(false)}
+        onHide={() => showCsvModal(true)}
         centered={true}
         data-testid={`${testIdPrefix}-csv-modal`}
killedBy: StaffTabComponent Tests CSV modal closes on close button
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="InstructorCourseShowPage-csv-modal"
>
  <div
    class="modal-content"

[Killed] BooleanLiteral
main/components/TabComponent/StaffTabComponent.jsx:110:19
       <Modal
         show={csvModal}
         onHide={() => showCsvModal(false)}
-        centered={true}
+        centered={false}
         data-testid={`${testIdPrefix}-csv-modal`}
       >
killedBy: StaffTabComponent Tests CSV upload button opens modal and submits file, invalidates cache
statusReason: expect(element).toHaveClass("modal-dialog modal-dialog-centered")

Expected the element to have class:
  modal-dialog modal-dialog-centered
Received:
  modal-dialog

[Killed] BooleanLiteral
main/components/TabComponent/StaffTabComponent.jsx:136:43
         <Col>
           <div className="d-flex align-items-center position-relative">
             <Button
-              onClick={() => showCsvModal(true)}
+              onClick={() => showCsvModal(false)}
               data-testid={`${testIdPrefix}-csv-button`}
               className="w-100 pe-5"
killedBy: StaffTabComponent Tests CSV upload button opens modal and submits file, invalidates cache
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-csv-modal"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-StaffTabComponent"
    >

[Killed] ArrowFunction
main/components/TabComponent/StaffTabComponent.jsx:136:24
         <Col>
           <div className="d-flex align-items-center position-relative">
             <Button
-              onClick={() => showCsvModal(true)}
+              onClick={() => undefined}
               data-testid={`${testIdPrefix}-csv-button`}
               className="w-100 pe-5"
killedBy: StaffTabComponent Tests CSV upload button opens modal and submits file, invalidates cache
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-csv-modal"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-StaffTabComponent"
    >

[Killed] StringLiteral
main/components/TabComponent/StaffTabComponent.jsx:137:28
           <div className="d-flex align-items-center position-relative">
             <Button
               onClick={() => showCsvModal(true)}
-              data-testid={`${testIdPrefix}-csv-button`}
+              data-testid={``}
               className="w-100 pe-5"
             >
killedBy: StaffTabComponent Tests CSV upload button opens modal and submits file, invalidates cache
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-csv-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-StaffTabComponent"
    >

[Killed] StringLiteral
main/components/TabComponent/StaffTabComponent.jsx:151:29
               <BsInfoCircle
                 onClick={openCsvHelp}
                 style={{
-                  position: "absolute",
+                  position: "",
                   top: "50%",
                   right: "0.75rem",
killedBy: StaffTabComponent Tests CSV help icon opens help page
statusReason: expect(element).toHaveStyle()

- Expected

- color: rgb(255, 255, 255);
- cursor: pointer;
- fontSize: 0.9rem;
- position: absolute;

[Killed] StringLiteral
main/components/TabComponent/StaffTabComponent.jsx:158:31
                   color: "#fff",
                   cursor: "pointer",
                   fontSize: "0.9rem",
-                  userSelect: "none",
+                  userSelect: "",
                 }}
                 data-testid={`${testIdPrefix}-csv-info-icon`}
killedBy: StaffTabComponent Tests CSV help icon opens help page
statusReason: expect(element).toHaveStyle()

- Expected

- color: rgb(255, 255, 255);
- cursor: pointer;
- fontSize: 0.9rem;
- position: absolute;

[Killed] StringLiteral
main/components/TabComponent/StaffTabComponent.jsx:180:41
               <Button
                 className="w-100 button btn-secondary disabled"
                 disabled
-                style={{ pointerEvents: "none" }}
+                style={{ pointerEvents: "" }}
                 aria-disabled="true"
               >
killedBy: StaffTabComponent Tests for coming soon tooltip on disabled download CSV button
statusReason: expect(element).toHaveStyle()

- Expected

- pointerEvents: none;

[Killed] ConditionalExpression
main/components/TabComponent/StaffTabComponent.jsx:215:15
             if (staffMember.email.toLowerCase().includes(searchTermLower)) {
               return true;
             } else if (
-              staffMember.githubLogin?.toLowerCase().includes(searchTermLower)
+              true
             ) {
               return true;
killedBy: StaffTabComponent Tests Search filter works correctly First Name, Email
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Mark
Received:
  Dr. John
