[Killed] LogicalOperator
main/components/CourseStaff/CourseStaffCSVUploadForm.jsx:25:12
           {...register("upload", { required: true })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.upload && "File is required."}
+          {errors.upload || "File is required."}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: CourseStaffCSVUploadForm Tests No errors on good submit
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="invalid-feedback"
>
  File is required.
</div> instead

[Killed] ConditionalExpression
main/components/CourseStaff/CourseStaffCSVUploadForm.jsx:25:12
           {...register("upload", { required: true })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.upload && "File is required."}
+          {true}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: CourseStaffCSVUploadForm Tests Required fires when there's no input
statusReason: Unable to find an element with the text: /File is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
