[Killed] BlockStatement
main/components/TabComponent/StaffTabComponent.jsx:44:39
     },
   });
 
-  const onSuccessStaff = (modalFn) => {
-    toast("Staff roster successfully updated.");
-    setSearchTerm("");
-    modalFn(false);
-  };
+  const onSuccessStaff = (modalFn) => {};
 
   const onErrorStaff = (error) => {
killedBy: StaffTabComponent Tests StaffForm submit works and clears search filter
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Survived] BlockStatement
main/components/TabComponent/StaffTabComponent.jsx:50:35
     modalFn(false);
   };
 
-  const onErrorStaff = (error) => {
-    toast.error(
-      error?.response?.data ||
-        "Error adding staff member. Please check whether this email already exists.",
-    );
-  };
+  const onErrorStaff = (error) => {};
 
   const staffPostMutation = useBackendMutation(

[Survived] ConditionalExpression
main/components/TabComponent/StaffTabComponent.jsx:52:7
 
   const onErrorStaff = (error) => {
     toast.error(
-      error?.response?.data ||
-        "Error adding staff member. Please check whether this email already exists.",
+      true,
     );
   };

[Survived] LogicalOperator
main/components/TabComponent/StaffTabComponent.jsx:52:7
 
   const onErrorStaff = (error) => {
     toast.error(
-      error?.response?.data ||
-        "Error adding staff member. Please check whether this email already exists.",
+      error?.response?.data && "Error adding staff member. Please check whether this email already exists.",
     );
   };

[Killed] ArrowFunction
main/components/TabComponent/StaffTabComponent.jsx:60:18
   const staffPostMutation = useBackendMutation(
     objectToAxiosParamsPost,
     {
-      onSuccess: () => onSuccessStaff(showPostModal),
+      onSuccess: () => undefined,
       onError: onErrorStaff,
     },
killedBy: StaffTabComponent Tests StaffForm submit works and clears search filter
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ArrowFunction
main/components/TabComponent/StaffTabComponent.jsx:70:35
     staffPostMutation.mutate(staff);
   };
 
-  const renderComingSoonTooltip = (props) => (
-    <Tooltip id="coming-soon-tooltip" {...props}>
-      Coming Soon
-    </Tooltip>
-  );
+  const renderComingSoonTooltip = () => undefined;
 
   return (
killedBy: StaffTabComponent Tests for coming soon tooltip on disabled upload CSV button
statusReason: The argument must be a React element, but you passed undefined.
