[Killed] ArrayDeclaration
main/pages/Instructor/InstructorCourseShowPage.jsx:53:6
         clearTimeout(timer);
       };
     }
-  }, [getCourseFailed, navigate]);
+  }, []);
 
   const testId = "InstructorCourseShowPage";
killedBy: InstructorCourseShowPage tests Returns to course page on timeout
statusReason: Unable to find an element with the text: Course not found. You will be returned to the course list in 3 seconds.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:78:14
       ) : (
         <div className="border rounded-3 p-4 mb-4">
           <div className="d-flex align-items-center gap-3">
-            {course.orgName && (
-              <img
-                src={`https://github.com/${course.orgName}.png?size=64`}
-                alt={course.orgName}
-                data-testid={`${testId}-github-org-image`}
-                className="rounded-circle border"
-                style={{ width: 48, height: 48 }}
-              />
-            )}
+            {true}
             <div>
               <div className="d-flex align-items-center gap-2">
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-github-org-image"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:84:24
                 alt={course.orgName}
                 data-testid={`${testId}-github-org-image`}
                 className="rounded-circle border"
-                style={{ width: 48, height: 48 }}
+                style={{}}
               />
             )}
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: expect(element).toHaveStyle()

- Expected

- height: 48px;
- width: 48px;

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:106:34
                     target="_blank"
                     rel="noopener noreferrer"
                     className="text-primary text-decoration-none fs-5"
-                    data-testid={`${testId}-github-org-link`}
+                    data-testid={``}
                   >
                     {course.orgName}
killedBy: InstructorCourseShowPage tests header displays correct info when course is loaded (and displays warning)
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-github-org-link"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:154:24
             currentUser={currentUser}
           />
         </Tab>
-        <Tab eventKey={"teams"} title={"Teams"} className="pt-2">
+        <Tab eventKey={""} title={"Teams"} className="pt-2">
           <TeamsTabComponent
             courseId={courseId}
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: expect(element).toHaveAttribute("data-rr-ui-event-key", "teams") // element.getAttribute("data-rr-ui-event-key") === "teams"

Expected the element to have attribute:
  data-rr-ui-event-key="teams"
Received:
  data-rr-ui-event-key=""
