[Killed] BlockStatement
main/components/TabComponent/DownloadsTabComponent.jsx:4:75
 import React from "react";
 import { Button, Col, Row } from "react-bootstrap";
 
-export default function DownloadsTabComponent({ courseId, testIdPrefix }) {
-  const downloadCsv = () => {
-    window.open(`/api/csv/rosterstudents?courseId=${courseId}`, "_blank");
-  };
-
-  return (
-    <div data-testid={`${testIdPrefix}-DownloadsTabComponent`}>
-      <Row sm={3} className="p-2">
-        <Col>
-          <Button 
-            onClick={downloadCsv} 
-            className="w-100"
-            data-testid={`${testIdPrefix}-download-student-csv-button`}
-          >
-            Download Student CSV
-          </Button>
-        </Col>
-      </Row>
-    </div>
-  );
-}
+export default function DownloadsTabComponent({ courseId, testIdPrefix }) {}
killedBy: InstructorCourseShowPage tests Tab Components are Present
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-DownloadsTabComponent"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] BlockStatement
main/components/TabComponent/DownloadsTabComponent.jsx:5:29
 import { Button, Col, Row } from "react-bootstrap";
 
 export default function DownloadsTabComponent({ courseId, testIdPrefix }) {
-  const downloadCsv = () => {
-    window.open(`/api/csv/rosterstudents?courseId=${courseId}`, "_blank");
-  };
+  const downloadCsv = () => {};
 
   return (
killedBy: DownloadsTabComponent Tests calls window.open with correct url
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0
