[Killed] BooleanLiteral
main/components/Courses/CourseWarningBanner.jsx:9:16
   const [
     hideDefaultBasePermissionWarning,
     setHideDefaultBasePermissionWarning,
-  ] = useState(false);
+  ] = useState(true);
 
   const warningsQueryKey = [`/api/courses/warnings/${courseId}`];
killedBy: CourseWarningBanner tests shows default base permission warning when showDefaultBasePermissionWarning is true
statusReason: Unable to find an accessible element with the role "alert"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] StringLiteral
main/components/Courses/CourseWarningBanner.jsx:11:29
     setHideDefaultBasePermissionWarning,
   ] = useState(false);
 
-  const warningsQueryKey = [`/api/courses/warnings/${courseId}`];
+  const warningsQueryKey = [``];
 
   const { data: warnings } = useBackend(
killedBy: CourseWarningBanner tests calls useBackend with correct parameters
statusReason: expected "vi.fn()" to be called with arguments: [ [ '/api/courses/warnings/1' ], …(4) ]

Received:

  1st vi.fn() call:

@@ -1,8 +1,8 @@
  [

[Killed] ObjectLiteral
main/components/Courses/CourseWarningBanner.jsx:15:5
 
   const { data: warnings } = useBackend(
     warningsQueryKey,
-    {
-      method: "GET",
-      url: `/api/courses/warnings/${courseId}`,
-    },
+    {},
     undefined,
     true,
killedBy: InstructorCourseShowPage tests header displays correct info when course is loaded (and displays warning)
statusReason: Unable to find an element with the text: /This GitHub Organization/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ObjectLiteral
main/components/Courses/CourseWarningBanner.jsx:21:5
     },
     undefined,
     true,
-    {
-      placeholderData: {},
-      staleTime: "static",
-    },
+    {},
   );
 
killedBy: CourseWarningBanner tests calls useBackend with correct parameters
statusReason: expected "vi.fn()" to be called with arguments: [ [ '/api/courses/warnings/1' ], …(4) ]

Received:

  1st vi.fn() call:

@@ -6,10 +6,7 @@
      "method": "GET",

[Killed] StringLiteral
main/components/Courses/CourseWarningBanner.jsx:23:18
     true,
     {
       placeholderData: {},
-      staleTime: "static",
+      staleTime: "",
     },
   );
killedBy: CourseWarningBanner tests calls useBackend with correct parameters
statusReason: expected "vi.fn()" to be called with arguments: [ [ '/api/courses/warnings/1' ], …(4) ]

Received:

  1st vi.fn() call:

@@ -8,8 +8,8 @@
    },

[Killed] ArrowFunction
main/components/Courses/CourseWarningBanner.jsx:27:31
     },
   );
 
-  const objectToAxiosParams = () => ({
-    method: "POST",
-    url: `/api/course/warnings/hideBasePermissionWarning/${courseId}`,
-  });
+  const objectToAxiosParams = () => undefined;
 
   const hideDefaultBasePermissionWarningMutation = useBackendMutation(
killedBy: CourseWarningBanner tests calls useBackendMutation with correct parameters
statusReason: expected undefined to deeply equal { method: 'POST', …(1) }

[Killed] StringLiteral
main/components/Courses/CourseWarningBanner.jsx:28:13
   );
 
   const objectToAxiosParams = () => ({
-    method: "POST",
+    method: "",
     url: `/api/course/warnings/hideBasePermissionWarning/${courseId}`,
   });
killedBy: CourseWarningBanner tests calls useBackendMutation with correct parameters
statusReason: expected { method: '', …(1) } to deeply equal { method: 'POST', …(1) }

[Killed] BlockStatement
main/components/Courses/CourseWarningBanner.jsx:38:56
     warningsQueryKey,
   );
 
-  const handleHideDefaultBasePermissionWarning = () => {
-    setHideDefaultBasePermissionWarning(true);
-    hideDefaultBasePermissionWarningMutation.mutate();
-  };
+  const handleHideDefaultBasePermissionWarning = () => {};
 
   return (
killedBy: CourseWarningBanner tests hide button calls hideBasePermissionWarning mutation and hides warning
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BooleanLiteral
main/components/Courses/CourseWarningBanner.jsx:39:41
   );
 
   const handleHideDefaultBasePermissionWarning = () => {
-    setHideDefaultBasePermissionWarning(true);
+    setHideDefaultBasePermissionWarning(false);
     hideDefaultBasePermissionWarningMutation.mutate();
   };
killedBy: CourseWarningBanner tests hide button calls hideBasePermissionWarning mutation and hides warning
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="fade alert alert-warning show"
  role="alert"
>
  Warning: This GitHub Organization has default base permission set to

[Killed] LogicalOperator
main/components/Courses/CourseWarningBanner.jsx:45:8
 
   return (
     <>
-      {warnings?.showOrganizationAgeWarning === true && (
-        <Alert variant="warning">
-          Warning: This GitHub Organization is less than 30 days old. You will
-          experience difficulties enrolling more than 50 students in a day.
-        </Alert>
-      )}
+      {warnings?.showOrganizationAgeWarning === true || <Alert variant="warning">
+          Warning: This GitHub Organization is less than 30 days old. You will
+          experience difficulties enrolling more than 50 students in a day.
+        </Alert>}
 
       {warnings?.showDefaultBasePermissionWarning === true &&
killedBy: InstructorCourseShowPage tests header displays correct info when course is loaded (and displays warning)
statusReason: Unable to find an element with the text: /This GitHub Organization/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ConditionalExpression
main/components/Courses/CourseWarningBanner.jsx:45:8
 
   return (
     <>
-      {warnings?.showOrganizationAgeWarning === true && (
-        <Alert variant="warning">
-          Warning: This GitHub Organization is less than 30 days old. You will
-          experience difficulties enrolling more than 50 students in a day.
-        </Alert>
-      )}
+      {false}
 
       {warnings?.showDefaultBasePermissionWarning === true &&
killedBy: InstructorCourseShowPage tests header displays correct info when course is loaded (and displays warning)
statusReason: Unable to find an element with the text: /This GitHub Organization/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] BooleanLiteral
main/components/Courses/CourseWarningBanner.jsx:52:55
         </Alert>
       )}
 
-      {warnings?.showDefaultBasePermissionWarning === true &&
+      {warnings?.showDefaultBasePermissionWarning === false &&
         hideDefaultBasePermissionWarning === false && (
           <Alert variant="warning">
killedBy: CourseWarningBanner tests does not show default base permission warning when showDefaultBasePermissionWarning is false
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="fade alert alert-warning show"
  role="alert"
>
  Warning: This GitHub Organization has default base permission set to

[Killed] ConditionalExpression
main/components/Courses/CourseWarningBanner.jsx:52:8
         </Alert>
       )}
 
-      {warnings?.showDefaultBasePermissionWarning === true &&
-        hideDefaultBasePermissionWarning === false && (
-          <Alert variant="warning">
-            Warning: This GitHub Organization has default base permission set to{" "}
-            {warnings.defaultBasePermission}. Members of the organization may be
-            able to see private repositories.
-            <Button
-              variant="outline-dark"
-              size="sm"
-              className="ms-2"
-              onClick={handleHideDefaultBasePermissionWarning}
-            >
-              Hide
-            </Button>
-          </Alert>
-        )}
+      {false}
     </>
   );
killedBy: CourseWarningBanner tests shows default base permission warning when showDefaultBasePermissionWarning is true
statusReason: Unable to find an accessible element with the role "alert"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] EqualityOperator
main/components/Courses/CourseWarningBanner.jsx:53:9
       )}
 
       {warnings?.showDefaultBasePermissionWarning === true &&
-        hideDefaultBasePermissionWarning === false && (
+        hideDefaultBasePermissionWarning !== false && (
           <Alert variant="warning">
             Warning: This GitHub Organization has default base permission set to{" "}
killedBy: CourseWarningBanner tests shows default base permission warning when showDefaultBasePermissionWarning is true
statusReason: Unable to find an accessible element with the role "alert"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BooleanLiteral
main/components/Courses/CourseWarningBanner.jsx:53:46
       )}
 
       {warnings?.showDefaultBasePermissionWarning === true &&
-        hideDefaultBasePermissionWarning === false && (
+        hideDefaultBasePermissionWarning === true && (
           <Alert variant="warning">
             Warning: This GitHub Organization has default base permission set to{" "}
killedBy: CourseWarningBanner tests shows default base permission warning when showDefaultBasePermissionWarning is true
statusReason: Unable to find an accessible element with the role "alert"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />
</body>
